In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [5]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [6]:
%%sql
SELECT * FROM facts LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [7]:
%%sql
SELECT MIN(POPULATION), MAX(POPULATION), MIN(population_growth), MAX(population_growth)
FROM FACTS;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [9]:
%%sql
select name from facts where population = (select min(population) from facts);

Done.

[('Antarctica',)]

In [10]:
%%sql
select name from facts where population = (select max(population) from facts);

Done.

[('World',)]

In [13]:
%%sql
select avg(population), avg(area) from facts;

Done.

[(62094928.32231405, 555093.546184739)]

In [17]:
%%sql
SELECT name
FROM facts
WHERE name <> 'World' AND  
    population > (
        SELECT AVG(population)
        FROM facts
        WHERE name <> 'World') AND
     area < (
        SELECT AVG(area)
        FROM facts
        WHERE name <> 'World'
     )

Done.

[('Bangladesh',),
 ('Germany',),
 ('Iraq',),
 ('Italy',),
 ('Japan',),
 ('Korea, South',),
 ('Morocco',),
 ('Philippines',),
 ('Poland',),
 ('Spain',),
 ('Thailand',),
 ('Uganda',),
 ('United Kingdom',),
 ('Vietnam',)]